tests/performance/load-tests/intent-load.yml
# Artillery.js load test configuration for intent submission
# Tests the system's ability to handle high intent volume

config:
  target: 'http://localhost:3004' # Relayer service
  phases:
    - duration: 60
      arrivalRate: 1
      name: "Warm up"
    - duration: 120
      arrivalRate: 5
      name: "Ramp up load"
    - duration: 300
      arrivalRate: 20
      name: "Sustained load"
    - duration: 120
      arrivalRate: 50
      name: "Peak load"
    - duration: 60
      arrivalRate: 1
      name: "Cool down"
  processor: "../processors/intent-processor.js"
  variables:
    tokenIn:
      - "0xC02aaA39b223FE8D0A0e5C4F27eAD9083C756Cc2" # WETH
      - "0xA0b86a33E6417b7b5c1eC7E0AA5d4aFe5B40FAbE" # USDC
      - "0xdAC17F958D2ee523a2206206994597C13D831ec7" # USDT
    tokenOut:
      - "0xA0b86a33E6417b7b5c1eC7E0AA5d4aFe5B40FAbE" # USDC
      - "0xC02aaA39b223FE8D0A0e5C4F27eAD9083C756Cc2" # WETH
      - "0x6B175474E89094C44Da98b954EedeAC495271d0F" # DAI
    amountIn:
      - "1000000000000000000"    # 1 ETH
      - "500000000000000000"     # 0.5 ETH
      - "2000000000000000000"    # 2 ETH
      - "10000000000000000000"   # 10 ETH

scenarios:
  - name: "Create Intent"
    weight: 80
    flow:
      - function: "generateIntentData"
      - post:
          url: "/api/intents"
          headers:
            Content-Type: "application/json"
          json:
            intent:
              tokenIn: "{{ tokenIn }}"
              tokenOut: "{{ tokenOut }}"
              amountIn: "{{ amountIn }}"
              maxSlippageBps: 300
              deadline: "{{ deadline }}"
              chainId: "196"
              receiver: "{{ receiver }}"
              nonce: "{{ nonce }}"
            signature: "{{ signature }}"
          capture:
            - json: "$.data.intentHash"
              as: "intentHash"
            - json: "$.data.biddingWindowMs"
              as: "biddingWindowMs"
          expect:
            - statusCode: 201
            - contentType: json
            - hasProperty: "data.intentHash"
      - think: 1

  - name: "Query Intent Status"
    weight: 15
    flow:
      - function: "generateIntentData"
      - post:
          url: "/api/intents"
          headers:
            Content-Type: "application/json"
          json:
            intent:
              tokenIn: "{{ tokenIn }}"
              tokenOut: "{{ tokenOut }}"
              amountIn: "{{ amountIn }}"
              maxSlippageBps: 300
              deadline: "{{ deadline }}"
              chainId: "196"
              receiver: "{{ receiver }}"
              nonce: "{{ nonce }}"
            signature: "{{ signature }}"
          capture:
            - json: "$.data.intentHash"
              as: "intentHash"
      - get:
          url: "/api/intents/{{ intentHash }}"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: "data.intent"

  - name: "Health Check"
    weight: 5
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200
            - hasProperty: "status"

# Performance requirements validation
expect:
  - responseTime:
      p95: 500 # 95% of requests should complete within 500ms
      p99: 1000 # 99% of requests should complete within 1s
  - errorRate: 
      max: 1 # Less than 1% error rate